package lesson07;

import java.util.Arrays;

public class Ex250414 {
	public static void main(String[] args) {
		// 1. 피보나치 수열 출력
		// 반복문 관련
		// 피보나치 수열 숫자 20개 출력
		// 규칙 첫 두자리 숫자의 합이 다음 숫자의 합. 그 다음 숫자는 이전 두 숫자의 합의 연속
		// 1 1 2 3 4 5 13 21 44 65 109 ...
		
		int sum = 0 ;
		for (int i = 0; i <= 20 ; i++) {
			
			System.out.println(sum);
		}
		
			
		// 2. 50개의 길이를 가지는 정수 배열 생성. 각 값은 1~20사이의 숫자로 채우기
		// 이후 중복된 값을 제거한 새로운 배열을 생성 (새 배열을 추가해라)
		
		
		
		
		// 3. 2차원 배열
		/*
		 *  **
		 *  **
		 *  **
		 *  *****
		 *  *****
		 *        */
//		char[][] chs = {
//			{'*','*',' ',' ',' '},
//			{'*','*',' ',' ',' '},
//			{'*','*',' ',' ',' '},
//			{'*','*','*','*','*'},
//			{'*','*','*','*','*'}
//		};
//		// 90도 시계 방향 회의 결과를 result에 담으시오.
//		char[][] result = new char[5][5];

		
		
		
		
//		=======================================
//		배열 복사부터 중요해짐
//
//		3일 뒤 JVM 배움
//		main.지역변수
//
//		참조자료형의 대한 이해 > 객체지향의 시작
//
//		4.25 금요일까지 자바 끝
//
//		향상된 for 문
//		당분간 인덱스 for문만 잘 이용해도 됨
//
//		참조자료형
//		arr. , name. 컨트롤 스페이스 누르면 나오는거 
//
//		int age = x;
//		age.  > 컨트롤 스페이스 누르면 안나옴 
//
//		배열의 단점 
//
//		배열은 엑셀 열의 개념
//		클래스는 행이라는 느낌으로 이해하기
//
//		클래스 = 설계도
//		객체 = 피조물
//
//		f(n)=f(n-1)+f(n-2)
	
	}
}
